templates/consulta/consulta.xml

<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/"><S:Body>
  <ns2:ConsultarNfseRequest xmlns:ns2="http://ws.bhiss.pbh.gov.br">
      
      <nfseCabecMsg>
&lt;cabecalho xmlns=&quot;http://www.abrasf.org.br/nfse.xsd&quot; versao=&quot;1.00&quot;&gt;&lt;versaoDados&gt;1.00&lt;/versaoDados&gt;&lt;/cabecalho&gt;
    </nfseCabecMsg>
      
      <nfseDadosMsg>
        &lt;ConsultarNfseEnvio xmlns=&quot;http://www.abrasf.org.br/nfse.xsd&quot;&gt;
        &lt;Prestador&gt;
        &lt;Cnpj&gt;18801297000150&lt;/Cnpj&gt;
        &lt;InscricaoMunicipal&gt;09233890010&lt;/InscricaoMunicipal&gt;
        &lt;/Prestador&gt;
        &lt;PeriodoEmissao&gt;
            &lt;DataInicial&gt;{{start_date}}&lt;/DataInicial&gt;
            &lt;DataFinal&gt;{{end_date}}&lt;/DataFinal&gt;
        &lt;/PeriodoEmissao&gt;
        &lt;/ConsultarNfseEnvio&gt;
      </nfseDadosMsg>
    </ns2:ConsultarNfseRequest>
  </S:Body>
</S:Envelope>