source/.NET Standard/Unimake.Business.DFe/Servicos/Config/NFSe/PortoAlegreRS.xml

<?xml version="1.0" encoding="utf-8"?>
<Configuracoes>
	<Servicos ID="NFSe">
		<RecepcionarLoteRps versao="1.00">
			<Descricao>Recepcionar Lote RPS</Descricao>
			<WebEnderecoHomologacao>https://nfse-hom.procempa.com.br/bhiss-ws/nfse?wsdl</WebEnderecoHomologacao>
			<WebEnderecoProducao>https://nfe.portoalegre.rs.gov.br/bhiss-ws/nfse?wsdl</WebEnderecoProducao>
			<WebActionHomologacao>http://ws.bhiss.pbh.gov.br/RecepcionarLoteRps</WebActionHomologacao>
			<WebActionProducao>http://ws.bhiss.pbh.gov.br/RecepcionarLoteRps</WebActionProducao>
			<SchemaArquivo>nfse.xsd</SchemaArquivo>
			<TagAssinatura>Rps</TagAssinatura>
			<TagAtributoID>InfRps</TagAtributoID>
			<TagLoteAssinatura>EnviarLoteRpsEnvio</TagLoteAssinatura>
			<TagLoteAtributoID>LoteRps</TagLoteAtributoID>
			<WebContentType>text/xml;charset=UTF-8</WebContentType>
			<WebSoapString><![CDATA[<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><RecepcionarLoteRpsRequest xmlns="http://ws.bhiss.pbh.gov.br"><nfseCabecMsg xmlns="">&lt;cabecalho xmlns="http://www.abrasf.org.br/nfse.xsd" versao="1.00"&gt;&lt;versaoDados &gt;1.00&lt;/versaoDados &gt;&lt;/cabecalho&gt;</nfseCabecMsg><nfseDadosMsg xmlns="">{xmlBodyScape}</nfseDadosMsg></RecepcionarLoteRpsRequest></soap:Body></soap:Envelope>]]></WebSoapString>
			<WebTagRetorno>S:Body</WebTagRetorno>
			<WebEncodingRetorno>UTF-8</WebEncodingRetorno>
			<WebSoapVersion>soap11</WebSoapVersion>
			<SchemaVersao>1.00</SchemaVersao>
			<TargetNS>http://www.abrasf.org.br/nfse.xsd</TargetNS>
		</RecepcionarLoteRps>
		<GerarNfse versao="1.00">
			<Descricao>Gerar Nota Fiscal de Serviço</Descricao>
			<WebEnderecoHomologacao>https://nfse-hom.procempa.com.br/bhiss-ws/nfse?wsdl</WebEnderecoHomologacao>
			<WebEnderecoProducao>https://nfe.portoalegre.rs.gov.br/bhiss-ws/nfse?wsdl</WebEnderecoProducao>
			<WebActionHomologacao>http://ws.bhiss.pbh.gov.br/GerarNfse</WebActionHomologacao>
			<WebActionProducao>http://ws.bhiss.pbh.gov.br/GerarNfse</WebActionProducao>
			<SchemaArquivo>nfse.xsd</SchemaArquivo>
			<TagAssinatura>Rps</TagAssinatura>
			<TagAtributoID>InfRps</TagAtributoID>
			<TagLoteAssinatura>GerarNfseEnvio</TagLoteAssinatura>
			<TagLoteAtributoID>LoteRps</TagLoteAtributoID>
			<WebContentType>text/xml;charset=UTF-8</WebContentType>
			<WebSoapString><![CDATA[<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><GerarNfseRequest xmlns="http://ws.bhiss.pbh.gov.br"><nfseCabecMsg xmlns="">&lt;cabecalho xmlns="http://www.abrasf.org.br/nfse.xsd" versao="1.00"&gt;&lt;versaoDados &gt;1.00&lt;/versaoDados &gt;&lt;/cabecalho&gt;</nfseCabecMsg><nfseDadosMsg xmlns="">{xmlBodyScape}</nfseDadosMsg></GerarNfseRequest></soap:Body></soap:Envelope>]]></WebSoapString>
			<WebTagRetorno>S:Body</WebTagRetorno>
			<WebEncodingRetorno>UTF-8</WebEncodingRetorno>
			<WebSoapVersion>soap11</WebSoapVersion>
			<SchemaVersao>1.00</SchemaVersao>
			<TargetNS>http://www.abrasf.org.br/nfse.xsd</TargetNS>
		</GerarNfse>
		<CancelarNfse versao="1.00">
			<Descricao>Cancelar nota fiscal de serviço</Descricao>
			<WebEnderecoHomologacao>https://nfse-hom.procempa.com.br/bhiss-ws/nfse?wsdl</WebEnderecoHomologacao>
			<WebEnderecoProducao>https://nfe.portoalegre.rs.gov.br/bhiss-ws/nfse?wsdl</WebEnderecoProducao>
			<WebActionHomologacao>http://ws.bhiss.pbh.gov.br/CancelarNfse</WebActionHomologacao>
			<WebActionProducao>http://ws.bhiss.pbh.gov.br/CancelarNfse</WebActionProducao>
			<SchemaArquivo>nfse.xsd</SchemaArquivo>
			<TagAssinatura>Pedido</TagAssinatura>
			<TagAtributoID>InfPedidoCancelamento</TagAtributoID>
			<TagLoteAssinatura></TagLoteAssinatura>
			<TagLoteAtributoID></TagLoteAtributoID>
			<WebContentType>text/xml;charset=UTF-8</WebContentType>
			<WebSoapString><![CDATA[<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><CancelarNfseRequest xmlns="http://ws.bhiss.pbh.gov.br"><nfseCabecMsg xmlns="">&lt;cabecalho xmlns="http://www.abrasf.org.br/nfse.xsd" versao="1.00"&gt;&lt;versaoDados &gt;1.00&lt;/versaoDados &gt;&lt;/cabecalho&gt;</nfseCabecMsg><nfseDadosMsg xmlns="">{xmlBodyScape}</nfseDadosMsg></CancelarNfseRequest></soap:Body></soap:Envelope>]]></WebSoapString>
			<WebTagRetorno>S:Body</WebTagRetorno>
			<WebEncodingRetorno>UTF-8</WebEncodingRetorno>
			<WebSoapVersion>soap11</WebSoapVersion>
			<SchemaVersao>1.00</SchemaVersao>
			<TargetNS>http://www.abrasf.org.br/nfse.xsd</TargetNS>
		</CancelarNfse>
		<ConsultarLoteRps versao="1.00">
			<Descricao>Consulta lote RPS</Descricao>
			<WebEnderecoHomologacao>https://nfse-hom.procempa.com.br/bhiss-ws/nfse?wsdl</WebEnderecoHomologacao>
			<WebEnderecoProducao>https://nfe.portoalegre.rs.gov.br/bhiss-ws/nfse?wsdl</WebEnderecoProducao>
			<WebActionHomologacao>http://ws.bhiss.pbh.gov.br/ConsultarLoteRps</WebActionHomologacao>
			<WebActionProducao>http://ws.bhiss.pbh.gov.br/ConsultarLoteRps</WebActionProducao>
			<SchemaArquivo>nfse.xsd</SchemaArquivo>
			<TagAssinatura></TagAssinatura>
			<TagAtributoID></TagAtributoID>
			<TagLoteAssinatura></TagLoteAssinatura>
			<TagLoteAtributoID></TagLoteAtributoID>
			<WebContentType>text/xml;charset=utf-8</WebContentType>
			<WebSoapString><![CDATA[<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><ConsultarLoteRpsRequest xmlns="http://ws.bhiss.pbh.gov.br"><nfseCabecMsg xmlns="">&lt;cabecalho xmlns="http://www.abrasf.org.br/nfse.xsd" versao="1.00"&gt;&lt;versaoDados &gt;1.00&lt;/versaoDados &gt;&lt;/cabecalho&gt;</nfseCabecMsg><nfseDadosMsg xmlns="">{xmlBodyScape}</nfseDadosMsg></ConsultarLoteRpsRequest></soap:Body></soap:Envelope>]]></WebSoapString>
			<WebTagRetorno>S:Body</WebTagRetorno>
			<WebEncodingRetorno>UTF-8</WebEncodingRetorno>
			<WebSoapVersion>soap11</WebSoapVersion>
			<SchemaVersao>1.00</SchemaVersao>
			<TargetNS>http://www.abrasf.org.br/nfse.xsd</TargetNS>
		</ConsultarLoteRps>
		<ConsultarNfsePorRps versao="1.00">
			<Descricao>Consulta NFSe por RPS</Descricao>
			<WebEnderecoHomologacao>https://nfse-hom.procempa.com.br/bhiss-ws/nfse?wsdl</WebEnderecoHomologacao>
			<WebEnderecoProducao>https://nfe.portoalegre.rs.gov.br/bhiss-ws/nfse?wsdl</WebEnderecoProducao>
			<WebActionHomologacao>http://ws.bhiss.pbh.gov.br/ConsultarNfsePorRps</WebActionHomologacao>
			<WebActionProducao>http://ws.bhiss.pbh.gov.br/ConsultarNfsePorRps</WebActionProducao>
			<SchemaArquivo>nfse.xsd</SchemaArquivo>
			<TagAssinatura></TagAssinatura>
			<TagAtributoID></TagAtributoID>
			<TagLoteAssinatura></TagLoteAssinatura>
			<TagLoteAtributoID></TagLoteAtributoID>
			<WebContentType>text/xml;charset=UTF-8</WebContentType>
			<WebSoapString><![CDATA[<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><ConsultarNfsePorRpsRequest xmlns="http://ws.bhiss.pbh.gov.br"><nfseCabecMsg xmlns="">&lt;cabecalho xmlns="http://www.abrasf.org.br/nfse.xsd" versao="1.00"&gt;&lt;versaoDados &gt;1.00&lt;/versaoDados &gt;&lt;/cabecalho&gt;</nfseCabecMsg><nfseDadosMsg xmlns="">{xmlBodyScape}</nfseDadosMsg></ConsultarNfsePorRpsRequest></soap:Body></soap:Envelope>]]></WebSoapString>
			<WebTagRetorno>S:Body</WebTagRetorno>
			<WebEncodingRetorno>UTF-8</WebEncodingRetorno>
			<WebSoapVersion>soap11</WebSoapVersion>
			<SchemaVersao>1.00</SchemaVersao>
			<TargetNS>http://www.abrasf.org.br/nfse.xsd</TargetNS>
		</ConsultarNfsePorRps>
		<ConsultarNfseFaixa versao="1.00">
			<Descricao>Consulta NFSe por Faixa</Descricao>
			<WebEnderecoHomologacao>https://nfse-hom.procempa.com.br/bhiss-ws/nfse?wsdl</WebEnderecoHomologacao>
			<WebEnderecoProducao>https://nfe.portoalegre.rs.gov.br/bhiss-ws/nfse?wsdl</WebEnderecoProducao>
			<WebActionHomologacao>http://ws.bhiss.pbh.gov.br/ConsultarNfsePorFaixa</WebActionHomologacao>
			<WebActionProducao>http://ws.bhiss.pbh.gov.br/ConsultarNfsePorFaixa</WebActionProducao>
			<SchemaArquivo>nfse.xsd</SchemaArquivo>
			<TagAssinatura></TagAssinatura>
			<TagAtributoID></TagAtributoID>
			<TagLoteAssinatura></TagLoteAssinatura>
			<TagLoteAtributoID></TagLoteAtributoID>
			<WebContentType>text/xml;charset=UTF-8</WebContentType>
			<WebSoapString><![CDATA[<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><ConsultarNfsePorFaixaRequest xmlns="http://ws.bhiss.pbh.gov.br"><nfseCabecMsg xmlns="">&lt;cabecalho xmlns="http://www.abrasf.org.br/nfse.xsd" versao="1.00"&gt;&lt;versaoDados &gt;1.00&lt;/versaoDados &gt;&lt;/cabecalho&gt;</nfseCabecMsg><nfseDadosMsg xmlns="">{xmlBodyScape}</nfseDadosMsg></ConsultarNfsePorFaixaRequest></soap:Body></soap:Envelope>]]></WebSoapString>
			<WebTagRetorno>S:Body</WebTagRetorno>
			<WebEncodingRetorno>UTF-8</WebEncodingRetorno>
			<WebSoapVersion>soap11</WebSoapVersion>
			<SchemaVersao>1.00</SchemaVersao>
			<TargetNS>http://www.abrasf.org.br/nfse.xsd</TargetNS>
		</ConsultarNfseFaixa>
		<ConsultarNfse versao="1.00">
			<Descricao>Consultar Nfse</Descricao>
			<WebEnderecoHomologacao>https://nfse-hom.procempa.com.br/bhiss-ws/nfse?wsdl</WebEnderecoHomologacao>
			<WebEnderecoProducao>https://nfe.portoalegre.rs.gov.br/bhiss-ws/nfse?wsdl</WebEnderecoProducao>
			<WebActionHomologacao>http://ws.bhiss.pbh.gov.br/ConsultarNfse</WebActionHomologacao>
			<WebActionProducao>http://ws.bhiss.pbh.gov.br/ConsultarNfse</WebActionProducao>
			<SchemaArquivo></SchemaArquivo>
			<TagAssinatura></TagAssinatura>
			<TagAtributoID></TagAtributoID>
			<TagLoteAssinatura></TagLoteAssinatura>
			<TagLoteAtributoID></TagLoteAtributoID>
			<WebContentType>text/xml;charset=UTF-8</WebContentType>
			<WebSoapString><![CDATA[<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><ConsultarNfseRequest xmlns="http://ws.bhiss.pbh.gov.br"><nfseCabecMsg xmlns="">&lt;cabecalho xmlns="http://www.abrasf.org.br/nfse.xsd" versao="1.00"&gt;&lt;versaoDados &gt;1.00&lt;/versaoDados &gt;&lt;/cabecalho&gt;</nfseCabecMsg><nfseDadosMsg xmlns="">{xmlBodyScape}</nfseDadosMsg></ConsultarNfseRequest></soap:Body></soap:Envelope>]]></WebSoapString>
			<WebTagRetorno>S:Body</WebTagRetorno>
			<WebEncodingRetorno>UTF-8</WebEncodingRetorno>
			<WebSoapVersion>soap11</WebSoapVersion>
			<SchemaVersao>1.00</SchemaVersao>
			<TargetNS>http://www.abrasf.org.br/nfse.xsd</TargetNS>
		</ConsultarNfse>
		<ConsultarSituacaoLoteRps versao="1.00">
			<Descricao>Consultar Situação Lote Rps</Descricao>
			<WebEnderecoHomologacao>https://nfse-hom.procempa.com.br/bhiss-ws/nfse?wsdl</WebEnderecoHomologacao>
			<WebEnderecoProducao>https://nfe.portoalegre.rs.gov.br/bhiss-ws/nfse?wsdl</WebEnderecoProducao>
			<WebActionHomologacao>http://ws.bhiss.pbh.gov.br/ConsultarNfse</WebActionHomologacao>
			<WebActionProducao>http://ws.bhiss.pbh.gov.br/ConsultarNfse</WebActionProducao>
			<SchemaArquivo>nfse.xsd</SchemaArquivo>
			<TagAssinatura></TagAssinatura>
			<TagAtributoID></TagAtributoID>
			<TagLoteAssinatura></TagLoteAssinatura>
			<TagLoteAtributoID></TagLoteAtributoID>
			<WebContentType>text/xml;charset=UTF-8</WebContentType>
			<WebSoapString><![CDATA[<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><ConsultarSituacaoLoteRpsRequest xmlns="http://ws.bhiss.pbh.gov.br"><nfseCabecMsg xmlns="">&lt;cabecalho xmlns="http://www.abrasf.org.br/nfse.xsd" versao="1.00"&gt;&lt;versaoDados &gt;1.00&lt;/versaoDados &gt;&lt;/cabecalho&gt;</nfseCabecMsg><nfseDadosMsg xmlns="">{xmlBodyScape}</nfseDadosMsg></ConsultarSituacaoLoteRpsRequest></soap:Body></soap:Envelope>]]></WebSoapString>
			<WebTagRetorno>S:Body</WebTagRetorno>
			<WebEncodingRetorno>UTF-8</WebEncodingRetorno>
			<WebSoapVersion>soap11</WebSoapVersion>
			<SchemaVersao>1.00</SchemaVersao>
			<TargetNS>http://www.abrasf.org.br/nfse.xsd</TargetNS>
		</ConsultarSituacaoLoteRps>
	</Servicos>
</Configuracoes>